/*Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата).
Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*/
#include <stdio.h>
int main ()
{
    int a[100][100];
    int i, j, m, n;
    int ind1, ind2;
    int kv1 = 0, kv2 = 0, kv3 = 0, kv4 = 0;
    scanf("%d %d", &m, &n);
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    scanf("%d %d", &ind1, &ind2);
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            if (i < ind1 && j >= ind2)
            {
                kv1 = kv1 + a[i][j];
            }
            if (i < ind1 && j < ind2)
            {
                kv2 = kv2 + a[i][j];
            }
            if (i >= ind1 && j < ind2)
            {
                kv3 = kv3 + a[i][j];
            }
            if (i >= ind1 && j >= ind2)
            {
                kv4 = kv4 + a[i][j];
            }
        }
    }
    printf("%d %d %d %d",kv1,kv2,kv3,kv4);

    return 0;
}
