/*Да се напише програма која вчитува матрица со димензии MxN (макс. 100x100).
На почетокот се внесуваат димензиите на матрицата, а потоа и елементите на матрицата кои се само вредностите 1 и 0.
Програмата треба да изброи и отпечати на СИ во колку од редиците и колоните има барем 3 последователни елементи со вредност 1.
*/
#include <stdio.h>
int main ()
{
    int i , j , m , n;
    int a[100][100];
    scanf("%d %d" , &m , &n);
    int counter = 0;
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    for (i = 0; i < m; i++)
    {
        for (j = 0; j < n; j++)
        {
            if((a[i][j] == 1 && a[i][j+1] == 1 && a[i][j+2] == 1))
            {
                counter++;
                break;
            }
        }
    }
    for (j = 0; j < n; j++)
    {
        for (i = 0; i < m; i++)
        {
            if (a[i][j] == 1 && a[i+1][j] == 1 && a[i+2][j] == 1)
            {
                counter++;
                break;
            }
        }
    }
    printf("%d",counter);
    return 0;
}
