/*
Да се имплементира рекурзивна функција која за низа од цели броеви $[a{0}, a{1}, ..., a_{n-1}]$ ќе ја пресмета вредноста на непрекинатата дропка дефинирана како:

v=a0+1a1+...1an−2+1an−1

Да се напише програма во која се чита цел број N, по што се читаат елементите на низа од N цели броеви (не повеќе од 100).
Потоа се повикува рекурзивната функција и се печати резултатот во нов ред.
*/
#include <stdio.h>
float recursive (int  a[] , int i , int n)
{
    if (i == n - 1)
        return a[i];
    else
        return a[i] + (1/recursive(a,i+1,n));
}
int main ()
{
    int i , n;
    int a[100];
    scanf("%d",&n);
    for (i = 0; i < n; i++)
    {
        scanf("%d",&a[i]);
    }
    printf("%f",recursive(a,0,n));
    return 0;
}
